{
  "news":[
    {
      "id":1,
      "headline":"Asia Cup battles: Babar takes on Rashid, Kohli goes up against Hasaranga",
      "short_description":"With Asia's best going head to head in the UAE, here are four battles you do not want to miss",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/329200/329227.4.jpg",
      "img_desc":"",
      "time":"1 hr",
      "author":"Alagappan Muthu",
      "short_description_2":"It's country vs country, of course, but also player vs player, the mini battles that often make the games what they are. Here's our pick of four that might end up being the most engrossing at the Asia Cup.",
      "desc_heading":"The one everybody's waiting for - Babar vs Rashid",
      "full_desciption":
      [
        {"id":1,
        "desc1":"Babar Azam playing fast bowling is a thing of beauty. He is never ever rushed. It's as though having things hurled at him at 90mph is his idea of a good time. So naturally, opposition teams will try to take that away from him. But while denying the No. 1 batter in T20Is pace on the ball may appear a sound plan, it doesn't always produce results. Unless your name is Khan. Rashid Khan. The Afghanistan legspinner has dismissed the Pakistan captain more often (five times) than anybody else in the shortest format, and conceded just 59 runs off 48 balls. In fact, every single time they have met in a T20 match, Rashid has taken Babar out, and if they face off in the Asia Cup , it will be only their second meeting in T20Is."  
      },
      {"id":2,
      "desc1":""  
    },
    {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":2,
      "headline":"Kohli's slump: two factors that might have had a role to play",
      "short_description":"His current rough patch has lasted a lot longer than anyone might have imagined it might",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/342600/342663.4.jpg",
      "img_desc":"For most of his career Kohli has walked an elevated path, but now he must walk one that lesser mortals find themselves on more frequently  •  AFP via Getty Images",
      "time":"23-Aug-2022",
      "author":"Aakash Chopra",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
        "desc1":"The chatter started as the wait became longer for the elusive 71st international hundred, but now it has reached a point where the conversation is no longer just about the next century anymore. There's no doubt in anyone's mind about Virat Kohli's class and his skills, and even if he doesn't score another run in international cricket from here on, he will still be regarded as one of the greatest to have played the game. A man who did superhuman things and mastered all three formats like almost no others. Still, there's also no hiding from the fact that the bat that worked like a magic wand isn't obeying his commands anymore."  
      },
      {"id":2,
      "desc1":"There are more misses than hits. The aura of invincibility has faded and his presence doesn't instil the same fear in bowlers' minds as it used to earlier. But let's be honest: this has happened to everyone who has played the game before him. That is why you are always remembered for how you lived and not for how you died. Okay, I shall now leave the metaphors behind and focus on the issue at hand."  
    },
    {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":3,
      "headline":"Tom Alsop leads Sussex record rampage to home semi",
      "short_description":"Another hundred for Cheteshwar Pujara as Middlesex concede 240 in last 18 overs",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344684.4.jpg",
      "img_desc":"Tom Alsop's List A best swept Sussex to new heights  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Sussex 400 for 4 (Alsop 189*, Pujara 132) beat Middlesex 243 (Cracknell 71, Crocombe 3-33, Rawlins 3-61) by 157 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Sussex secured a home semi-final in the Royal London One-Day Cup after their rampant batsmen made 400 for four against Middlesex at Hove, hitting 249 from their last 20 overs. They were led by an unbeaten 189 not out by Tom Alsop, his best List A score, while captain Cheteshwar Pujara continued his spectacular form with 132, the pair adding 240 for the third wicket in 27 overs as Sussex topped Group A with six wins in eight matches. With results going against them elsewhere, Middlesex were knocked out of the competition. The Sussex total was their highest score in one-day cricket, beating their 399 in a 40-over game in Horsham."
    },
    {"id":2,
  "desc1":"They scored 397 for five against Somerset at Taunton on Friday. Long before they were finished, they had passed their previous one-day best against Middlesex, 333 for four at Hove last year. It was also the highest one-day score against Middlesex, beating Nottinghamshire's 368 for two at Lord's in the same competition in 2014.That left Middlesex needing to beat their previous best chase (292 for four against Surrey at Lord's in 2014) by a big margin. Essentially, Middlesex were required to play Twenty20 cricket for 50 overs. And, with their deep batting, they kept coming at the Sussex bowlers even as the wickets tumbled. Joe Cracknell led the way with a 73-ball 71, with ten fours and there were plenty of bright cameos but the task was overwhelming and they were bowled out for 243 in 38.1 overs. "
  },
        {"id":3,
    "desc1":"When Sussex started their innings, they looked unlikely to scale the heights. Invited to bat in damp conditions, under floodlights and heavy clouds, they must have suspected the odds were against them, even though the depleted Middlesex attack was missing the injured Umesh Yadav, Toby Greatwood and Ethan Bamber. Alsop, back from a back spasm and replacing Dan Ibrahim, and Ali Orr, in subdued form after his double century at Taunton, looked sedate rather than commanding as they took 58 runs off the opening ten overs."  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":4,
      "headline":"Marco Jansen: 'We don't take anything for granted because Mother Cricket will kick you in the backside'",
      "short_description":"South Africa's towering left-arm quick talks about his upbringing and the hard yards to get to the top",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344400/344483.jpg",
      "img_desc":"Marco Jansen had a strong start to the series against England at Lord's  •  Getty Images",
      "time":"12 hrs ago",
      "author":"Firdose Moonda",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Koos Jansen spotted the cricketing talent of his twin sons, Marco and Duan, when they were nine-years-old and ran with it. Much like Richard Williams, who masterminded Venus and Serena's rise to being among the best players tennis has ever seen, Koos made it his mission to train and talk to his kids about the sport he believed they would excel in, becoming cricket's equivalent of King Richard. Let's call him King Koos. Like Williams, and in keeping with a few other famous cricketing dads, Koos Jansen wasn't always gentle in his methods. 'There have been some very tough times when my dad was very tough on us,' Marco Jansen, South Africa's 22-year old tearaway, said. "
    },
    {"id":2,
  "desc1":"There was no sugarcoating. Back then, he spoke to us in the same way he is speaking to us now. Nothing has changed. That enabled us to grow and mature a bit quicker than all the other kids when we were a bit young.'Since we were growing up, he is the one that has been - not the tough guy - but harder on us, especially when it comes to sport.' Koos demanded the best from his boys in other spheres too, such as academics. 'But we weren't that great'."
  },
        {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":5,
      "headline":"Groin injury ends Krunal Pandya's Warwickshire stint",
      "short_description":"The injury is likely to keep the allrounder out of action for three weeks",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/343800/343868.4.jpg",
      "img_desc":"Krunal Pandya played five Royal London Cup matches for Warwickshire  •  Getty Images for Surrey CCC",
      "time":"22-Aug-2022",
      "author":"ESPNcricinfo staff",
      "short_description_2":"A groin injury has cut short Krunal Pandya's stint with Warwickshire. The allrounder, who was signed by the county team for the Royal London One-Day Cup, is due to return to India on Monday evening.",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Krunal picked up the injury while scoring 37 during Warwickshire's match against Nottinghamshire on August 17. He didn't come out to field during the second innings of the match, and also missed Warwickshire's next two games against Middlesex and Durham. Consultation with doctors has revealed that the injury is likely to keep Krunal out of action for three weeks, leaving him unavailable for the knockout stages should Warwickshire reach them. It's frustrating to lose Krunal for the remainder of the tournament, but he leaves the club with our very best wishes, Warwickshire's director of cricket Paul Farbrace said in a statement issued by the county. "
    },
    {"id":2,
  "desc1":"Krunal was an excellent role model around the group and I'm sure the younger members of the squad will have learnt a lot from him on and off the pitch.Due to the short turnaround, we won't be signing a replacement, however, I'm incredibly excited to see our squad build on Sunday's excellent win over Durham."
  },
        {"id":3,
    "desc1":"Krunal played five Royal London Cup matches for Warwickshire this season, scoring 134 runs at an average of 33.50, including an 82-ball 74 in the tied game against Surrey at The Oval. He picked up nine wickets at 25.00 with his left-arm spin, including successive three-fors against Sussex and Leicestershire."  
  },
  {"id":4,
  "desc1":"Warwickshire currently sit in fifth place in Group A of the Royal London Cup, with nine points from seven games, just one point behind the four teams currently ahead of them."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":6,
      "headline":"2023 ODI World Cup: West Indies' direct-qualification hopes take a beating",
      "short_description":"Over-rate penalty in the third ODI against New Zealand following the series loss has weakened their position",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344655.4.jpg",
      "img_desc":"West Indies have won just nine out of 24 matches in the current Super League cycle  •  AFP/Getty Images",
      "time":"21 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"West Indies' already wobbly chances of qualifying directly for the 2023 men's ODI World Cup have suffered a big setback after they were docked two Super League points for maintaining a slow over rate in the third ODI against New Zealand."
    },
    {"id":2,
  "desc1":"West Indies were in seventh place, with 80 points, even before the start of the ODI series against New Zealand, which was their last in the Super League cycle. They went on to lose the series 2-1, which took them to 90 points, but the two-point penalty brought them down to 88 points with a net run rate of -0.738."
  },
  {"id":3,
    "desc1":"They are currently in seventh place on the Super League table. The top eight teams - or seven, apart from hosts India - will qualify directly for the World Cup, with a qualifying event determining the other participants."  
  },
  {"id":4,
  "desc1":"While that keeps them in the range, Ireland, who are currently ninth with 68 points, can finish above West Indies if they win even two out of the three ODIs against Bangladesh at home next year, because they have a better NRR (-0.382), and a series win is likely to keep them above West Indies on the NRR front."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":7,
      "headline":"Dravid tests positive for Covid-19, to delay travel to UAE for Asia Cup",
      "short_description":"He will test again in two days' time; Paras Mhambrey to step in till then",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344652.4.jpg",
      "img_desc":"Rahul Dravid is expected to link up with the team on a later date  •  AFP/Getty Images",
      "time":"21 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Rahul Dravid, India's head coach, has tested positive for Covid-19 and is not travelling with the rest of the team that will assemble in Dubai today for the Asia Cup. It is believed Dravid had mild symptoms, which have receded. He will test again in two days' time. Paras Mhambrey, the bowling coach, will step in till then."
    },
    {"id":2,
  "desc1":"A call on whether VVS Laxman - who coached India in Zimbabwe as Dravid took a short break - will join the team in Dubai too will likely be taken only after Dravid takes the test in two days. India's first match in the Asia Cup will be on August 28 against Pakistan."
  },
        {"id":3,
    "desc1":"Team India Head Coach Rahul Dravid has tested positive for COVID-19 in a routine test conducted ahead of the team's departure to the UAE for Asia Cup 2022, a BCCI release said. Mr. Dravid is under the supervision of the BCCI Medical team and has mild symptoms. He will join the team once he returns with a negative COVID-19 report. The rest of the team will assemble in UAE on 23rd August, 2022."  
  },
  {"id":4,
  "desc1":"The Asia Cup is likely to be India's last tournament before they announce the team for the T20 World Cup in Australia in October-November. In that light, the Asia Cup is an important tournament for the decision-makers to be around. It is believed that 11 or 12 slots in the squad are more or less booked, but the Asia Cup could have a bearing on the last three-four places. India will also be waiting on the fitness of Harshal Patel and Jasprit Bumrah who are at NCA in Bangalore for rehab."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":8,
      "headline":"Hayley Matthews hopes to bring 'flair' as she joins Melbourne Renegades",
      "short_description":"The West Indies captain will join Harmanpreet Kaur at the top of the order",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344300/344312.4.jpg",
      "img_desc":"Hayley Matthews has recently been playing in the Hundred  •  ECB/Getty Images",
      "time":"2 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"West Indies captain Hayley Matthews has signed with Melbourne Renegades for the upcoming WBBL season."
    },
    {"id":2,
  "desc1":"In five of the past seven years, Matthews has played for Hobart Hurricanes where she scored 865 runs at 18.02 and took 41 wickets."
  },
        {"id":3,
    "desc1":"Her signing means she will team up with Harmanpreet Kaur in Renegades' top order."  
  },
  {"id":4,
  "desc1":"'Any team that I'm part of, I try to bring a bit of West Indian flair to it,' Matthews said. 'I really like to go out there and have fun every time I'm out on the field."  
},
{"id":5,
"desc1":"James Rosengarten, Melbourne Renegades general manager, said: 'Alongside Harmanpreet Kaur, we see Hayley playing an important role in our top four. She brings a wealth of experience at international level and in the WBBL."  
}
      ]
    },
    {
      "id":9,
      "headline":"Kane Richardson, Tom Helm drive Phoenix to key victory",
      "short_description":"Roy fails again after Livingstone, Moeen lift Phoenix to sufficient 166",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344695.4.jpg",
      "img_desc":"Kane Richardson was in the wickets as Oval's top-order struggled  •  Getty Images",
      "time":"7 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Birmingham Phoenix 166 for 6 (Livingstone 45, Moeen 42, Milnes 3-32) beat Oval Invincibles 156 for 8 (Helm 3-11, Richardson 3-22) by ten runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Kane Richardson struck twice in as many balls to seal a crucial Birmingham Phoenix success as they overcame Oval Invincibles by 10 runs to climb to third in the men's Hundred table."
    },
    {"id":2,
  "desc1":"Richardson, who removed Jordan Cox and Invincibles captain Sam Billings with successive deliveries, finished with three for 22 at the Kia Oval, while fellow seamer Tom Helm claimed an impressive three for 11."
  },
        {"id":3,
    "desc1":"Those performances underpinned the Phoenix victory despite the best efforts of the Curran brothers, with both Sam and Tom clattering a flurry of sixes but their side fell short on 156 for eight."  
  },
  {"id":4,
  "desc1":"Earlier, Liam Livingstone (45 from 32) and Moeen Ali (42 from 25) led the way as the visitors posted 166 for six, with their bowlers ensuring that proved to be a winning total."  
},
{"id":5,
"desc1":"Having endured a lean run in three innings since his unbeaten century against Southern Brave, big-hitting opener Will Smeed appeared to be back on track after Phoenix were put in."  
}
      ]
    },
    {
      "id":10,
      "headline":"Sam Northeast and Billy Root personal bests fail to see Glamorgan through",
      "short_description":"Kent's victory at Canterbury means record Glamorgan stand means nothing",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/288400/288445.4.jpg",
      "img_desc":"Billy Root's hundred could not take Glamorgan through  •  Getty Images",
      "time":"9 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Glamorgan 356 for 3 (Northeast 177*, Root 113*) beat Worcestershire 337 for 9 (Cox 84, Leach 63) by 19 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Sam Northeast and Billy Root re-wrote the record books as Glamorgan defeated Worcestershire Rapids by 19 runs at New Road but Glamorgan, the holders, just failed to reach the knockout stages."
    },
    {"id":2,
  "desc1":"Kent's last-over two wicket victory over Lancashire at Canterbury meant they advanced to the quarter-finals at Glamorgan's expense. Northeast hit his own and Glamorgan's List A best score of 177 not out from 148 balls with four sixes and 22 fours while Root equalled his best in this format by making 113 not out from 92 balls with seven sixes and six fours."
  },
        {"id":3,
    "desc1":"The pair plundered an unbroken 245 from just 28 overs as Glamorgan amassed 356-3 from 50 overs after being put into bat. It was Glamorgan's record fourth wicket partnership in List A cricket, surpassing the 234 by Root and Chris Cooke against Gloucestershire at Bristol three years ago."  
  },
  {"id":4,
  "desc1":"Northeast went past his previous best 132 versus Somerset in 2014 and the Glamorgan record of 169 by Jacques Rudolph against Sussex in the same year."  
},
{"id":5,
"desc1":"Worcestershire were powerless to halt the flood of runs and Root struck five sixes in the penultimate over from Dillon Pennington, the third of which brought up his century."  
}
      ]
    },
    {
      "id":11,
      "headline":"Somerset finally win - and that spells the end for Warwickshire",
      "short_description":"Lewis Goldsworthy's maiden List A hundred brings light to dismal campaign",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344688.4.jpg",
      "img_desc":"Lewis Goldsworthy struck a maiden List A century  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Somerset 266 for 5 (Goldsworthy 111, Rew 96) beat Warwickshire 252 (Rhodes 92, Brookes 51) by 14 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Somerset collected their first Royal London Cup win at the eighth and last attempt and dragged Warwickshire out of the competition in the process with a 14-run victory at Edgbaston."
    },
    {"id":2,
  "desc1":"Lewis Goldsworthy's maiden List A century (111, 116 balls) and Jack Brooks' excellent bowling (four for 38) underpinned a win which brought some belated light to a leaden campaign."
  },
        {"id":3,
    "desc1":"Somerset owed their total to a third-wicket stand of 198 in 35 overs between Goldsworthy and James Rew (96, 120). Olly Hannon-Dalby and Liam Norwell took two wickets apiece but George Garrett impressed most, conceding 37 from his ten overs."  
  },
  {"id":4,
  "desc1":"Warwickshire knew that reaching 267 would take them through to the knockout phase but their depleted batting order, without the injured Krunal Pandya and Michael Burgess, fell just short on 252 all out. Captain Will Rhodes (92, 103) and Ethan Brookes (51, 57) added 104 in 18 overs for the fifth wicket but there were no contributions of substance either side of their stand."  
},
{"id":5,
"desc1":"After choosing to bat, Somerset soon lost former Warwickshire opener Andy Umeed, bowled by Norwell who also had Steven Davies superbly caught low at slip by Rob Yates. With three vital championship games to come in September, the Bears will be encouraged to see Norwell starting to regain full fitness and menace."  
}
      ]
    },
    {
      "id":12,
      "headline":"Hampshire's sixteenth win in seventeen brings home semifinal",
      "short_description":"Aneurin Donald and John Turner have too much firepower for Yorkshire",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344689.4.jpg",
      "img_desc":"Aneurin Donald in action  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ESPNcricinfo staff ",
      "short_description_2":"Hampshire 313 for 9 (Donald 76, Brown 60, Revis 4-77) beat Yorkshire 241 (Turner 5-41) by 72 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Aneurin Donald's blistering, career-best 76 set in-form Hampshire up for a resounding Royal London Cup victory against Yorkshire at Scarborough, ensuring a home semi-final next Tuesday as a result."
    },
    {"id":2,
  "desc1":"Group B winners Hampshire's 16th win in 17 games across all competitions - they comfortably defended a 314 target to win by 72 runs - also left the Vikings sweating on their own qualification hopes."
  },
        {"id":3,
    "desc1":"Yorkshire knew a final day win would have secured third place in the table and an away eliminator clash on Friday. But defeat opened the door for Kent to bear them to a play-offs place."  
  },
  {"id":4,
  "desc1":"Donald clattered five sixes in a 31-ball innings which was the feature of the Hawks' 313 for nine having been inserted, while opener Ben Brown made 60 and Tom Prest 55."  
},
{"id":5,
"desc1":"Matthew Revis claimed his own career-best four for 77 from nine overs before adding 41 as Yorkshire attempted to recover from 31 for four in reply before being bowled out for a respectable 241 inside 46 overs. New-ball seamer John Turner impressed with five for 41 from 8.3."  
}
      ]
    },
    {
      "id":13,
      "headline":"Topley pulls out of the Hundred to ensure he is fit for T20 World Cup",
      "short_description":"Taking a short break feels like a sensible precaution to avoid injury and the risk of a longer lay-off.",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344200/344232.4.jpg",
      "img_desc":"Reece Topley picked up five wickets in his four appearances in the Hundred this season  •  Getty Images",
      "time":"11 hrs ago",
      "author":"Matt Roller",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Reece Topley has pulled out of the final two weeks of the Hundred in order to ensure he is fit to play in the T20 World Cup."
    },
    {"id":2,
  "desc1":"Topley was England's standout bowler in white-ball cricket this summer, taking 17 wickets across 10 limited-overs appearances against India and South Africa, and said in a statement that he had been 'feeling the effects of a busy summer more and more over the last few weeks.'"
  },
        {"id":3,
    "desc1":"Topley took five wickets - three of them in a crucial opening burst against Southern Brave - in his four appearances in the Hundred this season but his departure is a major blow to Invincibles' chances of play-off qualification."  
  },
  {"id":4,
  "desc1":"He previously missed their win against Welsh Fire in order to manage his body, and told ESPNcricinfo that he was 'having to box smart' ahead of the World Cup. 'Obviously there's a lot of chat about the schedule and to be honest, for me to play as much as I have this summer and try to get to October fully fit probably isn't sustainable,' he said."  
},
{"id":5,
"desc1":"Invincibles will also lose two overseas players after Tuesday night's game against Birmingham Phoenix: Sunil Narine will return to the Caribbean to play in the CPL, while Mohammad Hasnain has been called up to Pakistan's Asia Cup squad. Peter Hatzoglou, the Australian spinner, will replace Narine, with Hasnain's replacement unconfirmed."  
}
      ]
    },
    {
      "id":14,
      "headline":"Marco Jansen: 'We don't take anything for granted because Mother Cricket will kick you in the backside'",
      "short_description":"South Africa's towering left-arm quick talks about his upbringing and the hard yards to get to the top",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344400/344483.jpg",
      "img_desc":"Marco Jansen had a strong start to the series against England at Lord's  •  Getty Images",
      "time":"2 hrs ago",
      "author":"Firdose Moonda",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Koos Jansen spotted the cricketing talent of his twin sons, Marco and Duan, when they were nine-years-old and ran with it. Much like Richard Williams, who masterminded Venus and Serena's rise to being among the best players tennis has ever seen, Koos made it his mission to train and talk to his kids about the sport he believed they would excel in, becoming cricket's equivalent of King Richard. Let's call him King Koos."
    },
    {"id":2,
  "desc1":"Like Williams, and in keeping with a few other famous cricketing dads, Koos Jansen wasn't always gentle in his methods."
  },
        {"id":3,
    "desc1":"By Jansen's own admission, and despite some eye-watering numbers (164 and 80 respectively) in a T20 game for example, the pair were not stand-out youth players either. 'My high school career didn't go well. I wasn't the top schoolboy cricketer,' Jansen said."  
  },
  {"id":4,
  "desc1":"Neither of he nor Duan played in an Under-19 World Cup and both made their names as net bowlers. In a professional era where the pathways are clearly laid out, and usually followed, theirs is the stuff of fairytales, which is why when Jansen made his Test debut, with only 18 first-class appearances to his name (and of those only half in South Africa's top-tier of domestic cricket), he could barely believe his good fortune. 'If you had told me you will make your debut against India in South Africa, I would have laughed and said, no, there's no chance,' he said."  
},
{"id":5,
"desc1":"There was an element of his selection which was about him being in the right place at the right time. South Africa were without Anrich Nortje for that India series and would have picked Duanne Olivier for the Boxing Day Test but he had not fully recovered from Covid-19 and was nursing a hamstring niggle. When Jansen's name appeared on the team-sheet, it was a surprise and he found himself under scrutiny immediately."  
}
      ]
    },
    {
      "id":15,
      "headline":"Muzarabani back in Zimbabwe squad for Australia ODIs; Ervine remains injured",
      "short_description":"All three matches will take place in Townsville on August 28, August 31 and September 3",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/327000/327059.4.jpg",
      "img_desc":"Blessing Muzarabani had missed the home series against Bangladesh and India  •  Sportsfile via Getty Images",
      "time":"16 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"The fit-again fast bowler Blessing Muzarabani has made a comeback into Zimbabwe's ODI squad for the three-match series against Australia starting on August 28. Muzarabani missed Zimbabwe's recent limited-overs series against Bangladesh and India at home with a thigh muscle tear, but was passed fit to depart for Townsville on Tuesday with the rest of the 15-member squad."
    },
    {"id":2,
  "desc1":"Regis Chakabva will lead Zimbabwe for a third successive ODI series with regular captain Craig Ervine still recovering from hamstring injury. Tendai Chatara (collarbone fracture), left-arm spinner Wellington Masakadza (shoulder tendon injury) and opening batter Milton Shumba (quadricep injury) were all unavailable for selection as well."
  },
        {"id":3,
    "desc1":"The last time Zimbabwe played an ODI in Australia was during the 2015 World Cup, before which their previous assignment in the country was a tri-series involving the hosts and India way back in 2004."  
  },
  {"id":4,
  "desc1":"This upcoming series was initially scheduled for August 2020, but had to be postponed as a result of the Covid-19 pandemic."  
},
{"id":5,
"desc1":"The tour is part of the ODI Super League, which is being contested by 13 teams with the top eight qualifying for the 2023 World Cup in India. Zimbabwe sit 12th on the table, having won just three out of their 18 matches so far in the cycle. Australia occupy the eighth spot."  
}
      ]
    },
    {
      "id":16,
      "headline":"Asia Cup battles: Babar takes on Rashid, Kohli goes up against Hasaranga",
      "short_description":"With Asia's best going head to head in the UAE, here are four battles you do not want to miss",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/329200/329227.4.jpg",
      "img_desc":"",
      "time":"1 hr",
      "author":"Alagappan Muthu",
      "short_description_2":"It's country vs country, of course, but also player vs player, the mini battles that often make the games what they are. Here's our pick of four that might end up being the most engrossing at the Asia Cup.",
      "desc_heading":"The one everybody's waiting for - Babar vs Rashid",
      "full_desciption":
      [
        {"id":1,
        "desc1":"Babar Azam playing fast bowling is a thing of beauty. He is never ever rushed. It's as though having things hurled at him at 90mph is his idea of a good time. So naturally, opposition teams will try to take that away from him. But while denying the No. 1 batter in T20Is pace on the ball may appear a sound plan, it doesn't always produce results. Unless your name is Khan. Rashid Khan. The Afghanistan legspinner has dismissed the Pakistan captain more often (five times) than anybody else in the shortest format, and conceded just 59 runs off 48 balls. In fact, every single time they have met in a T20 match, Rashid has taken Babar out, and if they face off in the Asia Cup , it will be only their second meeting in T20Is."  
      },
      {"id":2,
      "desc1":""  
    },
    {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":17,
      "headline":"Kohli's slump: two factors that might have had a role to play",
      "short_description":"His current rough patch has lasted a lot longer than anyone might have imagined it might",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/342600/342663.4.jpg",
      "img_desc":"For most of his career Kohli has walked an elevated path, but now he must walk one that lesser mortals find themselves on more frequently  •  AFP via Getty Images",
      "time":"23-Aug-2022",
      "author":"Aakash Chopra",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
        "desc1":"The chatter started as the wait became longer for the elusive 71st international hundred, but now it has reached a point where the conversation is no longer just about the next century anymore. There's no doubt in anyone's mind about Virat Kohli's class and his skills, and even if he doesn't score another run in international cricket from here on, he will still be regarded as one of the greatest to have played the game. A man who did superhuman things and mastered all three formats like almost no others. Still, there's also no hiding from the fact that the bat that worked like a magic wand isn't obeying his commands anymore."  
      },
      {"id":2,
      "desc1":"There are more misses than hits. The aura of invincibility has faded and his presence doesn't instil the same fear in bowlers' minds as it used to earlier. But let's be honest: this has happened to everyone who has played the game before him. That is why you are always remembered for how you lived and not for how you died. Okay, I shall now leave the metaphors behind and focus on the issue at hand."  
    },
    {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":18,
      "headline":"Tom Alsop leads Sussex record rampage to home semi",
      "short_description":"Another hundred for Cheteshwar Pujara as Middlesex concede 240 in last 18 overs",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344684.4.jpg",
      "img_desc":"Tom Alsop's List A best swept Sussex to new heights  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Sussex 400 for 4 (Alsop 189*, Pujara 132) beat Middlesex 243 (Cracknell 71, Crocombe 3-33, Rawlins 3-61) by 157 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Sussex secured a home semi-final in the Royal London One-Day Cup after their rampant batsmen made 400 for four against Middlesex at Hove, hitting 249 from their last 20 overs. They were led by an unbeaten 189 not out by Tom Alsop, his best List A score, while captain Cheteshwar Pujara continued his spectacular form with 132, the pair adding 240 for the third wicket in 27 overs as Sussex topped Group A with six wins in eight matches. With results going against them elsewhere, Middlesex were knocked out of the competition. The Sussex total was their highest score in one-day cricket, beating their 399 in a 40-over game in Horsham."
    },
    {"id":2,
  "desc1":"They scored 397 for five against Somerset at Taunton on Friday. Long before they were finished, they had passed their previous one-day best against Middlesex, 333 for four at Hove last year. It was also the highest one-day score against Middlesex, beating Nottinghamshire's 368 for two at Lord's in the same competition in 2014.That left Middlesex needing to beat their previous best chase (292 for four against Surrey at Lord's in 2014) by a big margin. Essentially, Middlesex were required to play Twenty20 cricket for 50 overs. And, with their deep batting, they kept coming at the Sussex bowlers even as the wickets tumbled. Joe Cracknell led the way with a 73-ball 71, with ten fours and there were plenty of bright cameos but the task was overwhelming and they were bowled out for 243 in 38.1 overs. "
  },
        {"id":3,
    "desc1":"When Sussex started their innings, they looked unlikely to scale the heights. Invited to bat in damp conditions, under floodlights and heavy clouds, they must have suspected the odds were against them, even though the depleted Middlesex attack was missing the injured Umesh Yadav, Toby Greatwood and Ethan Bamber. Alsop, back from a back spasm and replacing Dan Ibrahim, and Ali Orr, in subdued form after his double century at Taunton, looked sedate rather than commanding as they took 58 runs off the opening ten overs."  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":19,
      "headline":"Marco Jansen: 'We don't take anything for granted because Mother Cricket will kick you in the backside'",
      "short_description":"South Africa's towering left-arm quick talks about his upbringing and the hard yards to get to the top",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344400/344483.jpg",
      "img_desc":"Marco Jansen had a strong start to the series against England at Lord's  •  Getty Images",
      "time":"12 hrs ago",
      "author":"Firdose Moonda",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Koos Jansen spotted the cricketing talent of his twin sons, Marco and Duan, when they were nine-years-old and ran with it. Much like Richard Williams, who masterminded Venus and Serena's rise to being among the best players tennis has ever seen, Koos made it his mission to train and talk to his kids about the sport he believed they would excel in, becoming cricket's equivalent of King Richard. Let's call him King Koos. Like Williams, and in keeping with a few other famous cricketing dads, Koos Jansen wasn't always gentle in his methods. 'There have been some very tough times when my dad was very tough on us,' Marco Jansen, South Africa's 22-year old tearaway, said. "
    },
    {"id":2,
  "desc1":"There was no sugarcoating. Back then, he spoke to us in the same way he is speaking to us now. Nothing has changed. That enabled us to grow and mature a bit quicker than all the other kids when we were a bit young.'Since we were growing up, he is the one that has been - not the tough guy - but harder on us, especially when it comes to sport.' Koos demanded the best from his boys in other spheres too, such as academics. 'But we weren't that great'."
  },
        {"id":3,
    "desc1":""  
  },
  {"id":4,
  "desc1":""  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":20,
      "headline":"Groin injury ends Krunal Pandya's Warwickshire stint",
      "short_description":"The injury is likely to keep the allrounder out of action for three weeks",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/343800/343868.4.jpg",
      "img_desc":"Krunal Pandya played five Royal London Cup matches for Warwickshire  •  Getty Images for Surrey CCC",
      "time":"22-Aug-2022",
      "author":"ESPNcricinfo staff",
      "short_description_2":"A groin injury has cut short Krunal Pandya's stint with Warwickshire. The allrounder, who was signed by the county team for the Royal London One-Day Cup, is due to return to India on Monday evening.",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Krunal picked up the injury while scoring 37 during Warwickshire's match against Nottinghamshire on August 17. He didn't come out to field during the second innings of the match, and also missed Warwickshire's next two games against Middlesex and Durham. Consultation with doctors has revealed that the injury is likely to keep Krunal out of action for three weeks, leaving him unavailable for the knockout stages should Warwickshire reach them. It's frustrating to lose Krunal for the remainder of the tournament, but he leaves the club with our very best wishes, Warwickshire's director of cricket Paul Farbrace said in a statement issued by the county. "
    },
    {"id":2,
  "desc1":"Krunal was an excellent role model around the group and I'm sure the younger members of the squad will have learnt a lot from him on and off the pitch.Due to the short turnaround, we won't be signing a replacement, however, I'm incredibly excited to see our squad build on Sunday's excellent win over Durham."
  },
        {"id":3,
    "desc1":"Krunal played five Royal London Cup matches for Warwickshire this season, scoring 134 runs at an average of 33.50, including an 82-ball 74 in the tied game against Surrey at The Oval. He picked up nine wickets at 25.00 with his left-arm spin, including successive three-fors against Sussex and Leicestershire."  
  },
  {"id":4,
  "desc1":"Warwickshire currently sit in fifth place in Group A of the Royal London Cup, with nine points from seven games, just one point behind the four teams currently ahead of them."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":21,
      "headline":"2023 ODI World Cup: West Indies' direct-qualification hopes take a beating",
      "short_description":"Over-rate penalty in the third ODI against New Zealand following the series loss has weakened their position",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344655.4.jpg",
      "img_desc":"West Indies have won just nine out of 24 matches in the current Super League cycle  •  AFP/Getty Images",
      "time":"21 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"West Indies' already wobbly chances of qualifying directly for the 2023 men's ODI World Cup have suffered a big setback after they were docked two Super League points for maintaining a slow over rate in the third ODI against New Zealand."
    },
    {"id":2,
  "desc1":"West Indies were in seventh place, with 80 points, even before the start of the ODI series against New Zealand, which was their last in the Super League cycle. They went on to lose the series 2-1, which took them to 90 points, but the two-point penalty brought them down to 88 points with a net run rate of -0.738."
  },
        {"id":3,
    "desc1":"They are currently in seventh place on the Super League table. The top eight teams - or seven, apart from hosts India - will qualify directly for the World Cup, with a qualifying event determining the other participants."  
  },
  {"id":4,
  "desc1":"While that keeps them in the range, Ireland, who are currently ninth with 68 points, can finish above West Indies if they win even two out of the three ODIs against Bangladesh at home next year, because they have a better NRR (-0.382), and a series win is likely to keep them above West Indies on the NRR front."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":22,
      "headline":"Dravid tests positive for Covid-19, to delay travel to UAE for Asia Cup",
      "short_description":"He will test again in two days' time; Paras Mhambrey to step in till then",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344652.4.jpg",
      "img_desc":"Rahul Dravid is expected to link up with the team on a later date  •  AFP/Getty Images",
      "time":"21 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Rahul Dravid, India's head coach, has tested positive for Covid-19 and is not travelling with the rest of the team that will assemble in Dubai today for the Asia Cup. It is believed Dravid had mild symptoms, which have receded. He will test again in two days' time. Paras Mhambrey, the bowling coach, will step in till then."
    },
    {"id":2,
  "desc1":"A call on whether VVS Laxman - who coached India in Zimbabwe as Dravid took a short break - will join the team in Dubai too will likely be taken only after Dravid takes the test in two days. India's first match in the Asia Cup will be on August 28 against Pakistan."
  },
        {"id":3,
    "desc1":"Team India Head Coach Rahul Dravid has tested positive for COVID-19 in a routine test conducted ahead of the team's departure to the UAE for Asia Cup 2022, a BCCI release said. Mr. Dravid is under the supervision of the BCCI Medical team and has mild symptoms. He will join the team once he returns with a negative COVID-19 report. The rest of the team will assemble in UAE on 23rd August, 2022."  
  },
  {"id":4,
  "desc1":"The Asia Cup is likely to be India's last tournament before they announce the team for the T20 World Cup in Australia in October-November. In that light, the Asia Cup is an important tournament for the decision-makers to be around. It is believed that 11 or 12 slots in the squad are more or less booked, but the Asia Cup could have a bearing on the last three-four places. India will also be waiting on the fitness of Harshal Patel and Jasprit Bumrah who are at NCA in Bangalore for rehab."  
},
{"id":5,
"desc1":""  
}
      ]
    },
    {
      "id":23,
      "headline":"Hayley Matthews hopes to bring 'flair' as she joins Melbourne Renegades",
      "short_description":"The West Indies captain will join Harmanpreet Kaur at the top of the order",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344300/344312.4.jpg",
      "img_desc":"Hayley Matthews has recently been playing in the Hundred  •  ECB/Getty Images",
      "time":"2 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"West Indies captain Hayley Matthews has signed with Melbourne Renegades for the upcoming WBBL season."
    },
    {"id":2,
  "desc1":"In five of the past seven years, Matthews has played for Hobart Hurricanes where she scored 865 runs at 18.02 and took 41 wickets."
  },
        {"id":3,
    "desc1":"Her signing means she will team up with Harmanpreet Kaur in Renegades' top order."  
  },
  {"id":4,
  "desc1":"'Any team that I'm part of, I try to bring a bit of West Indian flair to it,' Matthews said. 'I really like to go out there and have fun every time I'm out on the field."  
},
{"id":5,
"desc1":"James Rosengarten, Melbourne Renegades general manager, said: 'Alongside Harmanpreet Kaur, we see Hayley playing an important role in our top four. She brings a wealth of experience at international level and in the WBBL."  
}
      ]
    },
    {
      "id":24,
      "headline":"Kane Richardson, Tom Helm drive Phoenix to key victory",
      "short_description":"Roy fails again after Livingstone, Moeen lift Phoenix to sufficient 166",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344695.4.jpg",
      "img_desc":"Kane Richardson was in the wickets as Oval's top-order struggled  •  Getty Images",
      "time":"7 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Birmingham Phoenix 166 for 6 (Livingstone 45, Moeen 42, Milnes 3-32) beat Oval Invincibles 156 for 8 (Helm 3-11, Richardson 3-22) by ten runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Kane Richardson struck twice in as many balls to seal a crucial Birmingham Phoenix success as they overcame Oval Invincibles by 10 runs to climb to third in the men's Hundred table."
    },
    {"id":2,
  "desc1":"Richardson, who removed Jordan Cox and Invincibles captain Sam Billings with successive deliveries, finished with three for 22 at the Kia Oval, while fellow seamer Tom Helm claimed an impressive three for 11."
  },
        {"id":3,
    "desc1":"Those performances underpinned the Phoenix victory despite the best efforts of the Curran brothers, with both Sam and Tom clattering a flurry of sixes but their side fell short on 156 for eight."  
  },
  {"id":4,
  "desc1":"Earlier, Liam Livingstone (45 from 32) and Moeen Ali (42 from 25) led the way as the visitors posted 166 for six, with their bowlers ensuring that proved to be a winning total."  
},
{"id":5,
"desc1":"Having endured a lean run in three innings since his unbeaten century against Southern Brave, big-hitting opener Will Smeed appeared to be back on track after Phoenix were put in."  
}
      ]
    },
    {
      "id":25,
      "headline":"Sam Northeast and Billy Root personal bests fail to see Glamorgan through",
      "short_description":"Kent's victory at Canterbury means record Glamorgan stand means nothing",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/288400/288445.4.jpg",
      "img_desc":"Billy Root's hundred could not take Glamorgan through  •  Getty Images",
      "time":"9 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Glamorgan 356 for 3 (Northeast 177*, Root 113*) beat Worcestershire 337 for 9 (Cox 84, Leach 63) by 19 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Sam Northeast and Billy Root re-wrote the record books as Glamorgan defeated Worcestershire Rapids by 19 runs at New Road but Glamorgan, the holders, just failed to reach the knockout stages."
    },
    {"id":2,
  "desc1":"Kent's last-over two wicket victory over Lancashire at Canterbury meant they advanced to the quarter-finals at Glamorgan's expense. Northeast hit his own and Glamorgan's List A best score of 177 not out from 148 balls with four sixes and 22 fours while Root equalled his best in this format by making 113 not out from 92 balls with seven sixes and six fours."
  },
        {"id":3,
    "desc1":"The pair plundered an unbroken 245 from just 28 overs as Glamorgan amassed 356-3 from 50 overs after being put into bat. It was Glamorgan's record fourth wicket partnership in List A cricket, surpassing the 234 by Root and Chris Cooke against Gloucestershire at Bristol three years ago."  
  },
  {"id":4,
  "desc1":"Northeast went past his previous best 132 versus Somerset in 2014 and the Glamorgan record of 169 by Jacques Rudolph against Sussex in the same year."  
},
{"id":5,
"desc1":"Worcestershire were powerless to halt the flood of runs and Root struck five sixes in the penultimate over from Dillon Pennington, the third of which brought up his century."  
}
      ]
    },
    {
      "id":26,
      "headline":"Somerset finally win - and that spells the end for Warwickshire",
      "short_description":"Lewis Goldsworthy's maiden List A hundred brings light to dismal campaign",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344688.4.jpg",
      "img_desc":"Lewis Goldsworthy struck a maiden List A century  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ECB Reporters Network",
      "short_description_2":"Somerset 266 for 5 (Goldsworthy 111, Rew 96) beat Warwickshire 252 (Rhodes 92, Brookes 51) by 14 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Somerset collected their first Royal London Cup win at the eighth and last attempt and dragged Warwickshire out of the competition in the process with a 14-run victory at Edgbaston."
    },
    {"id":2,
  "desc1":"Lewis Goldsworthy's maiden List A century (111, 116 balls) and Jack Brooks' excellent bowling (four for 38) underpinned a win which brought some belated light to a leaden campaign."
  },
        {"id":3,
    "desc1":"Somerset owed their total to a third-wicket stand of 198 in 35 overs between Goldsworthy and James Rew (96, 120). Olly Hannon-Dalby and Liam Norwell took two wickets apiece but George Garrett impressed most, conceding 37 from his ten overs."  
  },
  {"id":4,
  "desc1":"Warwickshire knew that reaching 267 would take them through to the knockout phase but their depleted batting order, without the injured Krunal Pandya and Michael Burgess, fell just short on 252 all out. Captain Will Rhodes (92, 103) and Ethan Brookes (51, 57) added 104 in 18 overs for the fifth wicket but there were no contributions of substance either side of their stand."  
},
{"id":5,
"desc1":"After choosing to bat, Somerset soon lost former Warwickshire opener Andy Umeed, bowled by Norwell who also had Steven Davies superbly caught low at slip by Rob Yates. With three vital championship games to come in September, the Bears will be encouraged to see Norwell starting to regain full fitness and menace."  
}
      ]
    },
    {
      "id":27,
      "headline":"Hampshire's sixteenth win in seventeen brings home semifinal",
      "short_description":"Aneurin Donald and John Turner have too much firepower for Yorkshire",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344600/344689.4.jpg",
      "img_desc":"Aneurin Donald in action  •  Getty Images",
      "time":"11 hrs ago",
      "author":"ESPNcricinfo staff ",
      "short_description_2":"Hampshire 313 for 9 (Donald 76, Brown 60, Revis 4-77) beat Yorkshire 241 (Turner 5-41) by 72 runs",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Aneurin Donald's blistering, career-best 76 set in-form Hampshire up for a resounding Royal London Cup victory against Yorkshire at Scarborough, ensuring a home semi-final next Tuesday as a result."
    },
    {"id":2,
  "desc1":"Group B winners Hampshire's 16th win in 17 games across all competitions - they comfortably defended a 314 target to win by 72 runs - also left the Vikings sweating on their own qualification hopes."
  },
        {"id":3,
    "desc1":"Yorkshire knew a final day win would have secured third place in the table and an away eliminator clash on Friday. But defeat opened the door for Kent to bear them to a play-offs place."  
  },
  {"id":4,
  "desc1":"Donald clattered five sixes in a 31-ball innings which was the feature of the Hawks' 313 for nine having been inserted, while opener Ben Brown made 60 and Tom Prest 55."  
},
{"id":5,
"desc1":"Matthew Revis claimed his own career-best four for 77 from nine overs before adding 41 as Yorkshire attempted to recover from 31 for four in reply before being bowled out for a respectable 241 inside 46 overs. New-ball seamer John Turner impressed with five for 41 from 8.3."  
}
      ]
    },
    {
      "id":28,
      "headline":"Topley pulls out of the Hundred to ensure he is fit for T20 World Cup",
      "short_description":"Taking a short break feels like a sensible precaution to avoid injury and the risk of a longer lay-off.",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344200/344232.4.jpg",
      "img_desc":"Reece Topley picked up five wickets in his four appearances in the Hundred this season  •  Getty Images",
      "time":"11 hrs ago",
      "author":"Matt Roller",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Reece Topley has pulled out of the final two weeks of the Hundred in order to ensure he is fit to play in the T20 World Cup."
    },
    {"id":2,
  "desc1":"Topley was England's standout bowler in white-ball cricket this summer, taking 17 wickets across 10 limited-overs appearances against India and South Africa, and said in a statement that he had been 'feeling the effects of a busy summer more and more over the last few weeks.'"
  },
        {"id":3,
    "desc1":"Topley took five wickets - three of them in a crucial opening burst against Southern Brave - in his four appearances in the Hundred this season but his departure is a major blow to Invincibles' chances of play-off qualification."  
  },
  {"id":4,
  "desc1":"He previously missed their win against Welsh Fire in order to manage his body, and told ESPNcricinfo that he was 'having to box smart' ahead of the World Cup. 'Obviously there's a lot of chat about the schedule and to be honest, for me to play as much as I have this summer and try to get to October fully fit probably isn't sustainable,' he said."  
},
{"id":5,
"desc1":"Invincibles will also lose two overseas players after Tuesday night's game against Birmingham Phoenix: Sunil Narine will return to the Caribbean to play in the CPL, while Mohammad Hasnain has been called up to Pakistan's Asia Cup squad. Peter Hatzoglou, the Australian spinner, will replace Narine, with Hasnain's replacement unconfirmed."  
}
      ]
    },
    {
      "id":29,
      "headline":"Marco Jansen: 'We don't take anything for granted because Mother Cricket will kick you in the backside'",
      "short_description":"South Africa's towering left-arm quick talks about his upbringing and the hard yards to get to the top",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/344400/344483.jpg",
      "img_desc":"Marco Jansen had a strong start to the series against England at Lord's  •  Getty Images",
      "time":"2 hrs ago",
      "author":"Firdose Moonda",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"Koos Jansen spotted the cricketing talent of his twin sons, Marco and Duan, when they were nine-years-old and ran with it. Much like Richard Williams, who masterminded Venus and Serena's rise to being among the best players tennis has ever seen, Koos made it his mission to train and talk to his kids about the sport he believed they would excel in, becoming cricket's equivalent of King Richard. Let's call him King Koos."
    },
    {"id":2,
  "desc1":"Like Williams, and in keeping with a few other famous cricketing dads, Koos Jansen wasn't always gentle in his methods."
  },
        {"id":3,
    "desc1":"By Jansen's own admission, and despite some eye-watering numbers (164 and 80 respectively) in a T20 game for example, the pair were not stand-out youth players either. 'My high school career didn't go well. I wasn't the top schoolboy cricketer,' Jansen said."  
  },
  {"id":4,
  "desc1":"Neither of he nor Duan played in an Under-19 World Cup and both made their names as net bowlers. In a professional era where the pathways are clearly laid out, and usually followed, theirs is the stuff of fairytales, which is why when Jansen made his Test debut, with only 18 first-class appearances to his name (and of those only half in South Africa's top-tier of domestic cricket), he could barely believe his good fortune. 'If you had told me you will make your debut against India in South Africa, I would have laughed and said, no, there's no chance,' he said."  
},
{"id":5,
"desc1":"There was an element of his selection which was about him being in the right place at the right time. South Africa were without Anrich Nortje for that India series and would have picked Duanne Olivier for the Boxing Day Test but he had not fully recovered from Covid-19 and was nursing a hamstring niggle. When Jansen's name appeared on the team-sheet, it was a surprise and he found himself under scrutiny immediately."  
}
      ]
    },
    {
      "id":30,
      "headline":"Muzarabani back in Zimbabwe squad for Australia ODIs; Ervine remains injured",
      "short_description":"All three matches will take place in Townsville on August 28, August 31 and September 3",
      "img":"https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/327000/327059.4.jpg",
      "img_desc":"Blessing Muzarabani had missed the home series against Bangladesh and India  •  Sportsfile via Getty Images",
      "time":"16 hrs ago",
      "author":"ESPNcricinfo staff",
      "short_description_2":"",
      "desc_heading":"",
      "full_desciption":[
        {"id":1,
      "desc1":"The fit-again fast bowler Blessing Muzarabani has made a comeback into Zimbabwe's ODI squad for the three-match series against Australia starting on August 28. Muzarabani missed Zimbabwe's recent limited-overs series against Bangladesh and India at home with a thigh muscle tear, but was passed fit to depart for Townsville on Tuesday with the rest of the 15-member squad."
    },
    {"id":2,
  "desc1":"Regis Chakabva will lead Zimbabwe for a third successive ODI series with regular captain Craig Ervine still recovering from hamstring injury. Tendai Chatara (collarbone fracture), left-arm spinner Wellington Masakadza (shoulder tendon injury) and opening batter Milton Shumba (quadricep injury) were all unavailable for selection as well."
  },
        {"id":3,
    "desc1":"The last time Zimbabwe played an ODI in Australia was during the 2015 World Cup, before which their previous assignment in the country was a tri-series involving the hosts and India way back in 2004."  
  },
  {"id":4,
  "desc1":"This upcoming series was initially scheduled for August 2020, but had to be postponed as a result of the Covid-19 pandemic."  
},
{"id":5,
"desc1":"The tour is part of the ODI Super League, which is being contested by 13 teams with the top eight qualifying for the 2023 World Cup in India. Zimbabwe sit 12th on the table, having won just three out of their 18 matches so far in the cycle. Australia occupy the eighth spot."  
}
      ]
    }
    
  ]
}